aegean-odyssey/mpmd_marlin_1.1.x/stm32f0xx/stm32f0xx_hal_pcd-ao.c
/**
***************************************************************************
* @file    stm32f0xx_hal_pcd.c
* @author  MCD Application Team
* @brief   PCD HAL module driver.
*          This file provides firmware functions to manage the following
*          functionalities of the USB Peripheral Controller:
*           + Initialization and de-initialization functions
*           + IO operation functions
*           + Peripheral Control functions
*           + Peripheral State functions
@verbatim
===========================================================================
##### How to use this driver #####
===========================================================================
[..]
      The PCD HAL driver can be used as follows:

     (#) Declare a PCD_HandleTypeDef handle structure, for example:
         PCD_HandleTypeDef  hpcd;

     (#) Fill parameters of Init structure in HCD handle

     (#) Call HAL_PCD_Init() API to initialize the HCD peripheral
         (Core, Device core, ...)

     (#) Initialize the PCD low level resources through the
         HAL_PCD_MspInit() API:
         (##) Enable the PCD/USB Low Level interface clock using
              (+++) __HAL_RCC_USB_CLK_ENABLE);
         (##) Initialize the related GPIO clocks
         (##) Configure PCD pin-out
         (##) Configure PCD NVIC interrupt

     (#)Associate the Upper USB device stack to the HAL PCD Driver:
         (##) hpcd.pData = pdev;

     (#)Enable HCD transmission and reception:
         (##) HAL_PCD_Start();

@endverbatim
***************************************************************************
* @attention
* <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions
* are met:
*   1. Redistributions of source code must retain the above copyright
*      notice, this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright
*      notice, this list of conditions and the following disclaimer in the
*      documentation and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
* "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
* FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
* HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
* SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED
* TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
* PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
***************************************************************************
*/

/* Includes --------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/** @addtogroup STM32F0xx_HAL_Driver
 * @{
 */
#ifdef HAL_PCD_MODULE_ENABLED

#if defined(STM32F042x6) || \
    defined(STM32F048xx) || \
    defined(STM32F072xB) || \
    defined(STM32F078xx) || \
    defined(STM32F070xB) || \
    defined(STM32F070x6)

/** @defgroup PCD PCD
 * @brief PCD HAL module driver
 * @{
 */
/* Private typedef --------------------------------------------------------*/
/* Private define ---------------------------------------------------------*/
/** @defgroup PCD_Private_Define PCD Private Define
 * @{
 */
#define BTABLE_ADDRESS  (0x000)
/**
 * @}
 */

/* Private macro ----------------------------------------------------------*/
/* Private variables ------------------------------------------------------*/
/* Private function prototypes --------------------------------------------*/
/** @defgroup PCD_Private_Functions PCD Private Functions
 * @{
 */
static HAL_StatusTypeDef PCD_EP_ISR_Handler(PCD_HandleTypeDef *hpcd);

void PCD_WritePMA(USB_TypeDef * USBx,
		  uint8_t * pbUsrBuf,
		  uint16_t wPMABufAddr,
		  uint16_t wNBytes);

void PCD_ReadPMA(USB_TypeDef * USBx,
		 uint8_t * pbUsrBuf,
		 uint16_t wPMABufAddr,
		 uint16_t wNBytes);
/**
 * @}
 */

/* Exported functions -----------------------------------------------------*/
/** @defgroup PCD_Exported_Functions PCD Exported Functions
 * @{
 */
/** @defgroup PCD_Exported_Functions_Group1 Initialization and
 *  de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
 @verbatim
 ============================================================================
 ##### Initialization and de-initialization functions #####
 ============================================================================
     [..]  This section provides functions allowing to:
 @endverbatim
 * @{
 */

/**
 * @brief  Initializes the PCD according to the specified
 *         parameters in the PCD_InitTypeDef and create the associated handle.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_Init(PCD_HandleTypeDef * hpcd)
{
    int i;

    if (! hpcd)
	return HAL_ERROR;

    assert_param(IS_PCD_ALL_INSTANCE(hpcd->Instance));

    if (hpcd->State == HAL_PCD_STATE_RESET) {
	hpcd->Lock = HAL_UNLOCKED;
        // init the hardware (GPIO, CLOCK, NVIC, ...)
	HAL_PCD_MspInit(hpcd);
    }

    hpcd->State = HAL_PCD_STATE_BUSY;

    /* initialize the endpoint structures */

    for (i = 0; i < hpcd->Init.dev_endpoints ; i++) {
	hpcd->IN_ep[i].is_in = 1;
	hpcd->IN_ep[i].num = i;
	/* set as control until ep is actvated */
	hpcd->IN_ep[i].type = PCD_EP_TYPE_CTRL;
	hpcd->IN_ep[i].maxpacket = 0;
	hpcd->IN_ep[i].xfer_buff = 0;
	hpcd->IN_ep[i].xfer_len = 0;
    }

