aegean-odyssey/mpmd_marlin_1.1.x/stm32f0xx/stm32f0xx_hal_pcd-ao.c
    for (i = 0; i < hpcd->Init.dev_endpoints ; i++) {
	hpcd->OUT_ep[i].is_in = 0;
	hpcd->OUT_ep[i].num = i;
	/* set as control until ep is activated */
	hpcd->OUT_ep[i].type = PCD_EP_TYPE_CTRL;
	hpcd->OUT_ep[i].maxpacket = 0;
	hpcd->OUT_ep[i].xfer_buff = 0;
	hpcd->OUT_ep[i].xfer_len = 0;
    }

    /* intialize the device */

    hpcd->Instance->CNTR = USB_CNTR_FRES; // toggle reset
    hpcd->Instance->CNTR = 0;
    hpcd->Instance->ISTR = 0; // clear pending interrupts
    hpcd->Instance->BTABLE = BTABLE_ADDRESS;

    hpcd->Instance->CNTR =
	USB_CNTR_CTRM  |
	USB_CNTR_WKUPM |
	USB_CNTR_SUSPM |
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
	USB_CNTR_ERRM  |
	USB_CNTR_SOFM  |
	USB_CNTR_ESOFM |
#endif
	USB_CNTR_RESETM;

    hpcd->USB_Address = 0;
    hpcd->State= HAL_PCD_STATE_READY;

    return HAL_OK;
}


/**
 * @brief  DeInitializes the PCD peripheral
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DeInit(PCD_HandleTypeDef * hpcd)
{
    if (! hpcd)
	return HAL_ERROR;

    hpcd->State = HAL_PCD_STATE_BUSY;
    HAL_PCD_Stop(hpcd);
    HAL_PCD_MspDeInit(hpcd);
    hpcd->State = HAL_PCD_STATE_RESET;

    return HAL_OK;
}


/**
 * @brief  Initializes the PCD MSP.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_MspInit(PCD_HandleTypeDef * hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the
       callback is needed, the HAL_PCD_MspInit could be
       implemented in the user file
    */
}


/**
 * @brief  DeInitializes PCD MSP.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_MspDeInit(PCD_HandleTypeDef * hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the
       callback is needed, the HAL_PCD_MspDeInit could be
       implemented in the user file
    */
}
/**
 * @}
 */


/** @defgroup PCD_Exported_Functions_Group2 IO operation functions
 *  @brief   Data transfers functions
 *
 @verbatim
 ============================================================================
 ##### IO operation functions #####
 ============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the
    PCD data transfers.
 @endverbatim
 * @{
 */
/**
 * @brief  Start the USB device.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_Start(PCD_HandleTypeDef * hpcd)
{
    /* Enabling DP Pull-Down bit to Connect internal pull-up on USB DP line */
    hpcd->Instance->BCDR |= USB_BCDR_DPPU;
    return HAL_OK;
}


/**
 * @brief  Stop the USB device.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_Stop(PCD_HandleTypeDef * hpcd)
{
    __HAL_LOCK(hpcd);
    /* disable all interrupts and force USB reset */
    hpcd->Instance->CNTR = USB_CNTR_FRES;
    /* clear interrupt status register */
    hpcd->Instance->ISTR = 0;
    /* switch-off device */
    hpcd->Instance->CNTR = (USB_CNTR_FRES | USB_CNTR_PDWN);
    __HAL_UNLOCK(hpcd);
    return HAL_OK;
}


/**
 * @brief  This function handles PCD interrupt request.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
void HAL_PCD_IRQHandler(PCD_HandleTypeDef * hpcd)
{
    uint32_t wInterrupt_Mask = 0;

    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_CTR)) {
	/* servicing of the endpoint correct transfer interrupt */
	/* clear of the CTR flag into the sub */
	PCD_EP_ISR_Handler(hpcd);
    }

    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_RESET)) {
	__HAL_PCD_CLEAR_FLAG(hpcd, USB_ISTR_RESET);
	HAL_PCD_ResetCallback(hpcd);
	HAL_PCD_SetAddress(hpcd, 0);
    }

#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_PMAOVR)) {
	__HAL_PCD_CLEAR_FLAG(hpcd, USB_ISTR_PMAOVR);
    }
#endif

#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_ERR)) {
	__HAL_PCD_CLEAR_FLAG(hpcd, USB_ISTR_ERR);
    }
#endif

    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_SUSP)) {
	hpcd->Instance->CNTR |= USB_CNTR_FSUSP;
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
	/* force low-power mode in the macrocell */
	hpcd->Instance->CNTR |= USB_CNTR_LPMODE;
#endif
	if (! __HAL_PCD_GET_FLAG (hpcd, USB_ISTR_WKUP)) {
	    HAL_PCD_SuspendCallback(hpcd);
	}
	/* clear ISTR bit *AFTER* setting of CNTR_FSUSP */
	__HAL_PCD_CLEAR_FLAG(hpcd, USB_ISTR_SUSP);
    }

    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_WKUP)) {
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
	hpcd->Instance->CNTR &= (uint16_t)(~(USB_CNTR_LPMODE));
#endif
	/* set wInterrupt_Mask global variable */
	wInterrupt_Mask =
	    USB_CNTR_CTRM  |
	    USB_CNTR_WKUPM |
	    USB_CNTR_SUSPM |
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
	    USB_CNTR_ERRM  |
	    USB_CNTR_SOF   |
	    USB_CNTR_ESOFM |
#endif
	    USB_CNTR_RESETM;
	/* Set interrupt mask */
	hpcd->Instance->CNTR = wInterrupt_Mask;
	HAL_PCD_ResumeCallback(hpcd);
	__HAL_PCD_CLEAR_FLAG(hpcd, USB_ISTR_WKUP);
    }

#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_SOF)) {
	__HAL_PCD_CLEAR_FLAG(hpcd, USB_ISTR_SOF);
	HAL_PCD_SOFCallback(hpcd);
    }
#endif

#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (__HAL_PCD_GET_FLAG (hpcd, USB_ISTR_ESOF)) {
	/* clear ESOF flag in ISTR */
	__HAL_PCD_CLEAR_FLAG(hpcd, USB_ISTR_ESOF);
    }
#endif

#if 1  // UNNECESSARY CODE FOR OUR APPLICATION (REPLACEMENT CODE)
    __HAL_PCD_CLEAR_FLAG(hpcd, (USB_ISTR_PMAOVR |
				//USB_CNTR_WKUPM  |
				//USB_CNTR_SUSPM  |
				USB_ISTR_ERR    |
				USB_ISTR_SOF    |
				USB_ISTR_ESOF));
#endif
}


/**
 * @brief  Data out stage callbacks
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef * hpcd,
					 uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_DataOutStageCallback could be implemented
       in the user file
    */
}


/**
 * @brief  Data IN stage callbacks
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef * hpcd,
					uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_DataInStageCallback could be implemented
       in the user file
    */
}


/**
 * @brief  Setup stage callback
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef * hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_SetupStageCallback could be implemented
       in the user file
    */
}


/**
 * @brief  USB Start Of Frame callbacks
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_SOFCallback(PCD_HandleTypeDef * hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_SOFCallback could be implemented in
       the user file
    */
}


/**
 * @brief  USB Reset callbacks
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_ResetCallback could be implemented in
       the user file
    */
}


/**
 * @brief  Suspend event callbacks
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_SuspendCallback(PCD_HandleTypeDef * hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_SuspendCallback could be implemented
       in the user file
    */
}


/**
 * @brief  Resume event callbacks
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_ResumeCallback(PCD_HandleTypeDef * hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_ResumeCallback could be implemented in
       the user file
    */
}


/**
 * @brief  Incomplete ISO OUT callbacks
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef * hpcd,
					     uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_ISOOUTIncompleteCallback could be implemented
       in the user file
    */
}


/**
 * @brief  Incomplete ISO IN  callbacks
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef * hpcd,
					    uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_ISOINIncompleteCallback could be implemented
       in the user file
    */
}


/**
 * @brief  Connection event callbacks
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_ConnectCallback(PCD_HandleTypeDef * hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback
       is needed, the HAL_PCD_ConnectCallback could be implemented in
       the user file
    */
}


/**
 * @brief  Disconnection event callbacks
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef * hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function Should not be modified, when the callback is
     needed, the HAL_PCD_DisconnectCallback could be implemented in the
     user file
  */
}
/**
 * @}
 */

