aegean-odyssey/mpmd_marlin_1.1.x/stm32f0xx/stm32f0xx_hal_pcd-ao.c
/** @defgroup PCD_Exported_Functions_Group3 Peripheral Control functions
 *  @brief  management functions
 *
 @verbatim
 ============================================================================
 ##### Peripheral Control functions #####
 ============================================================================
    [..]
    This subsection provides a set of functions allowing to control the
    PCD data transfers.
  @endverbatim
  *@{
  */

/**
 * @brief  Connect the USB device
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DevConnect(PCD_HandleTypeDef * hpcd)
{
    __HAL_LOCK(hpcd);
    /* Enabling DP Pull-Down bit to Connect internal pull-up on USB DP line */
    hpcd->Instance->BCDR |= USB_BCDR_DPPU;
    __HAL_UNLOCK(hpcd);
    return HAL_OK;
}

/**
 * @brief  Disconnect the USB device
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DevDisconnect(PCD_HandleTypeDef * hpcd)
{
    __HAL_LOCK(hpcd);
    /* Disable DP Pull-Down bit */
    hpcd->Instance->BCDR &= (uint16_t)(~(USB_BCDR_DPPU));
    __HAL_UNLOCK(hpcd);
    return HAL_OK;
}


/**
 * @brief  Set the USB Device address
 * @param  hpcd PCD handle
 * @param  address new device address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_SetAddress(PCD_HandleTypeDef * hpcd,
				     uint8_t address)
{
    __HAL_LOCK(hpcd);

    if (address)
	// USB Address will be applied later
	hpcd->USB_Address = address;
    else
	// set device address and enable function
	hpcd->Instance->DADDR = USB_DADDR_EF;

    __HAL_UNLOCK(hpcd);
    return HAL_OK;
}


/**
 * @brief  Open and configure an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @param  ep_mps endpoint max packert size
 * @param  ep_type endpoint type
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Open(PCD_HandleTypeDef * hpcd,
				  uint8_t ep_addr,
				  uint16_t ep_mps,
				  uint8_t ep_type)
{
    HAL_StatusTypeDef ret = HAL_OK;
    PCD_EPTypeDef * ep;

    if (ep_addr & 0x80)
	ep = &hpcd->IN_ep[ep_addr & 0x7f];
    else
	ep = &hpcd->OUT_ep[ep_addr & 0x7f];
    ep->num = ep_addr & 0x7f;

    ep->is_in = ((0x80 & ep_addr) != 0);
    ep->maxpacket = ep_mps;
    ep->type = ep_type;

    __HAL_LOCK(hpcd);

    /* initialize Endpoint */
    switch (ep->type) {
    case PCD_EP_TYPE_CTRL:
	PCD_SET_EPTYPE(hpcd->Instance, ep->num, USB_EP_CONTROL);
	break;
    case PCD_EP_TYPE_BULK:
	PCD_SET_EPTYPE(hpcd->Instance, ep->num, USB_EP_BULK);
	break;
    case PCD_EP_TYPE_INTR:
	PCD_SET_EPTYPE(hpcd->Instance, ep->num, USB_EP_INTERRUPT);
	break;
    case PCD_EP_TYPE_ISOC:
	PCD_SET_EPTYPE(hpcd->Instance, ep->num, USB_EP_ISOCHRONOUS);
	break;
    default:
	break;
    }

    PCD_SET_EP_ADDRESS(hpcd->Instance, ep->num, ep->num);

#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (ep->doublebuffer) {
	/* Set the endpoint as double buffered */
	PCD_SET_EP_DBUF(hpcd->Instance, ep->num);
	/* Set buffer address for double buffered mode */
	PCD_SET_EP_DBUF_ADDR(hpcd->Instance,ep->num,ep->pmaaddr0,ep->pmaaddr1);

	if (! ep->is_in) {
	    /* Clear the data toggle bits for the endpoint IN/OUT */
	    PCD_CLEAR_RX_DTOG(hpcd->Instance, ep->num);
	    PCD_CLEAR_TX_DTOG(hpcd->Instance, ep->num);

	    /* Reset value of the data toggle bits for the endpoint out */
	    PCD_TX_DTOG(hpcd->Instance, ep->num);

	    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_VALID);
	    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_DIS);
	}
	else {
	    /* Clear the data toggle bits for the endpoint IN/OUT */
	    PCD_CLEAR_RX_DTOG(hpcd->Instance, ep->num);
	    PCD_CLEAR_TX_DTOG(hpcd->Instance, ep->num);
	    PCD_RX_DTOG(hpcd->Instance, ep->num);
	    /* Configure DISABLE status for the Endpoint */
	    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_DIS);
	    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_DIS);
	}
    }
    else
#endif // UNNECESSARY CODE FOR OUR APPLICATION
    {
	if (ep->is_in) {
	    /* Set the endpoint Transmit buffer address */
	    PCD_SET_EP_TX_ADDRESS(hpcd->Instance, ep->num, ep->pmaadress);
	    PCD_CLEAR_TX_DTOG(hpcd->Instance, ep->num);
	    /* Configure NAK status for the Endpoint */
	    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_NAK);
	}
	else {
	    /* Set the endpoint Receive buffer address */
	    PCD_SET_EP_RX_ADDRESS(hpcd->Instance, ep->num, ep->pmaadress);
	    /* vSet the endpoint Receive buffer counter */
	    PCD_SET_EP_RX_CNT(hpcd->Instance, ep->num, ep->maxpacket);
	    PCD_CLEAR_RX_DTOG(hpcd->Instance, ep->num);
	    /* Configure VALID status for the Endpoint */
	    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_VALID);
	}
    }

    __HAL_UNLOCK(hpcd);
    return ret;
}


/**
 * @brief  Deactivate an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Close(PCD_HandleTypeDef * hpcd, uint8_t ep_addr)
{
    PCD_EPTypeDef * ep;

    if (ep_addr & 0x80)
	ep = &hpcd->IN_ep[ep_addr & 0x7f];
    else
	ep = &hpcd->OUT_ep[ep_addr & 0x7f];

    ep->num = ep_addr & 0x7f;
    ep->is_in = ((0x80 & ep_addr) != 0);

    __HAL_LOCK(hpcd);
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (ep->doublebuffer) {
	if (! ep->is_in) {
	    /* Clear the data toggle bits for the endpoint IN/OUT */
	    PCD_CLEAR_RX_DTOG(hpcd->Instance, ep->num);
	    PCD_CLEAR_TX_DTOG(hpcd->Instance, ep->num);
	    /* Reset value of the data toggle bits for the endpoint out */
	    PCD_TX_DTOG(hpcd->Instance, ep->num);
	    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_DIS);
	    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_DIS);
	}
	else {
	    /* Clear the data toggle bits for the endpoint IN/OUT */
	    PCD_CLEAR_RX_DTOG(hpcd->Instance, ep->num);
	    PCD_CLEAR_TX_DTOG(hpcd->Instance, ep->num);
	    PCD_RX_DTOG(hpcd->Instance, ep->num);
	    /* Configure DISABLE status for the Endpoint */
	    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_DIS);
	    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_DIS);
	}
    }
    else
#endif // UNNECESSARY CODE FOR OUR APPLICATION
    {
	if (ep->is_in) {
	    PCD_CLEAR_TX_DTOG(hpcd->Instance, ep->num);
	    /* Configure DISABLE status for the Endpoint */
	    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_DIS);
	}
	else {
	    PCD_CLEAR_RX_DTOG(hpcd->Instance, ep->num);
	    /* Configure DISABLE status for the Endpoint */
	    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_DIS);
	}
    }
    __HAL_UNLOCK(hpcd);
    return HAL_OK;
}


/**
 * @brief  Receive an amount of data
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @param  pBuf pointer to the reception buffer
 * @param  len amount of data to be received
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Receive(PCD_HandleTypeDef * hpcd,
				     uint8_t ep_addr,
				     uint8_t * pBuf,
				     uint32_t len)
{

    PCD_EPTypeDef * ep;

    ep = &hpcd->OUT_ep[ep_addr & 0x7f];

    /* setup and start the Xfer */
    ep->xfer_buff = pBuf;
    ep->xfer_len = len;
    ep->xfer_count = 0;
    ep->is_in = 0;
    ep->num = ep_addr & 0x7f;

    /* Multi packet transfer */
    if (ep->xfer_len > ep->maxpacket) {
	len = ep->maxpacket;
	ep->xfer_len -= len;
    }
    else {
	len = ep->xfer_len;
	ep->xfer_len = 0;
    }

    /* configure and validate Rx endpoint */
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (ep->doublebuffer)
	/* Set the Double buffer counter */
	PCD_SET_EP_DBUF_CNT(hpcd->Instance, ep->num, ep->is_in, len);
    else
#endif // UNNECESSARY CODE FOR OUR APPLICATION
	/* Set RX buffer count */
	PCD_SET_EP_RX_CNT(hpcd->Instance, ep->num, len);

    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_VALID);
    return HAL_OK;
}


/**
 * @brief  Get Received Data Size
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval Data Size
 */
uint16_t HAL_PCD_EP_GetRxCount(PCD_HandleTypeDef * hpcd, uint8_t ep_addr)
{
    return hpcd->OUT_ep[ep_addr & 0x7f].xfer_count;
}


/**
 * @brief  Send an amount of data
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @param  pBuf pointer to the transmission buffer
 * @param  len amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Transmit(PCD_HandleTypeDef * hpcd,
				      uint8_t ep_addr,
				      uint8_t * pBuf,
				      uint32_t len)
{
    PCD_EPTypeDef * ep;
    uint16_t pmabuffer = 0;

    ep = &hpcd->IN_ep[ep_addr & 0x7f];

    /* setup and start the Xfer */
    ep->xfer_buff = pBuf;
    ep->xfer_len = len;
    ep->xfer_count = 0;
    ep->is_in = 1;
    ep->num = ep_addr & 0x7f;

    /* Multi packet transfer */
    if (ep->xfer_len > ep->maxpacket) {
	len = ep->maxpacket;
	ep->xfer_len -= len;
    }
    else {
	len = ep->xfer_len;
	ep->xfer_len = 0;
    }

