aegean-odyssey/mpmd_marlin_1.1.x/stm32f0xx/stm32f0xx_hal_pcd-ao.c
    /* configure and validate Tx endpoint */
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
    if (ep->doublebuffer) {
	/* Write the data to the USB endpoint */
	if ((PCD_GET_ENDPOINT(hpcd->Instance, ep->num)& USB_EP_DTOG_TX)
	    == USB_EP_DTOG_TX) {
	    /* Set the Double buffer counter for pmabuffer1 */
	    PCD_SET_EP_DBUF1_CNT(hpcd->Instance, ep->num, ep->is_in, len);
	    pmabuffer = ep->pmaaddr1;
	}
	else {
	    /* Set the Double buffer counter for pmabuffer0 */
	    PCD_SET_EP_DBUF0_CNT(hpcd->Instance, ep->num, ep->is_in, len);
	    pmabuffer = ep->pmaaddr0;
	}
	PCD_WritePMA(hpcd->Instance, ep->xfer_buff, pmabuffer, len);
	PCD_FreeUserBuffer(hpcd->Instance, ep->num, ep->is_in);
    }
    else
#endif // UNNECESSARY CODE FOR OUR APPLICATION
    {
	PCD_WritePMA(hpcd->Instance, ep->xfer_buff, ep->pmaadress, len);
	PCD_SET_EP_TX_CNT(hpcd->Instance, ep->num, len);
    }
    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_VALID);
    return HAL_OK;
}


/**
 * @brief  Set a STALL condition over an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_SetStall(PCD_HandleTypeDef * hpcd,
				      uint8_t ep_addr)
{
    PCD_EPTypeDef * ep;

    __HAL_LOCK(hpcd);

    if (0x80 & ep_addr)
	ep = &hpcd->IN_ep[ep_addr & 0x7f];
    else
	ep = &hpcd->OUT_ep[ep_addr];

    ep->is_stall = 1;
    ep->num = ep_addr & 0x7f;
    ep->is_in = ((ep_addr & 0x80) != 0);

    if (ep->num == 0) {
	/* This macro sets STALL status for RX & TX*/
	PCD_SET_EP_TXRX_STATUS(hpcd->Instance, ep->num,
			       USB_EP_RX_STALL,
			       USB_EP_TX_STALL);
    }
    else {
	if (ep->is_in) {
	    PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num , USB_EP_TX_STALL);
	}
	else {
	    PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num , USB_EP_RX_STALL);
	}
    }
    __HAL_UNLOCK(hpcd);
    return HAL_OK;
}


/**
 * @brief  Clear a STALL condition over in an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_ClrStall(PCD_HandleTypeDef * hpcd,
				      uint8_t ep_addr)
{
    PCD_EPTypeDef * ep;

    if (0x80 & ep_addr)
	ep = &hpcd->IN_ep[ep_addr & 0x7f];
    else
	ep = &hpcd->OUT_ep[ep_addr];

    ep->is_stall = 0;
    ep->num = ep_addr & 0x7f;
    ep->is_in = ((ep_addr & 0x80) != 0);

    __HAL_LOCK(hpcd);

    if (ep->is_in) {
	PCD_CLEAR_TX_DTOG(hpcd->Instance, ep->num);
	PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, USB_EP_TX_VALID);
    }
    else {
	PCD_CLEAR_RX_DTOG(hpcd->Instance, ep->num);
	PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, USB_EP_RX_VALID);
    }
    __HAL_UNLOCK(hpcd);
    return HAL_OK;
}


/**
 * @brief  Flush an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Flush(PCD_HandleTypeDef * hpcd, uint8_t ep_addr)
{
    return HAL_OK;
}


/**
 * @brief  HAL_PCD_ActivateRemoteWakeup : active remote wakeup signalling
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_ActivateRemoteWakeup(PCD_HandleTypeDef * hpcd)
{
    if (hpcd->Init.lpm_enable) {
	/* Apply L1 Resume */
	hpcd->Instance->CNTR |= USB_CNTR_L1RESUME;
    }
    else {
	/* Apply L2 Resume */
	hpcd->Instance->CNTR |= USB_CNTR_RESUME;
    }
    return (HAL_OK);
}


/**
 * @brief  HAL_PCD_DeActivateRemoteWakeup : de-active remote wakeup signalling
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DeActivateRemoteWakeup(PCD_HandleTypeDef * hpcd)
{
    if (hpcd->Init.lpm_enable) {
	/* Release L1 Resume */
	hpcd->Instance->CNTR &= ((uint16_t)(~ USB_CNTR_L1RESUME));
    }
    else {
	/* Release L2 Resume */
	hpcd->Instance->CNTR &= ((uint16_t)(~ USB_CNTR_RESUME)) ;
    }
    return (HAL_OK);
}
/**
 * @}
 */

/** @defgroup PCD_Exported_Functions_Group4 Peripheral State functions
 *  @brief   Peripheral State functions
 *
 @verbatim
 ============================================================================
 ##### Peripheral State functions #####
 ============================================================================
    [..]
    This subsection permits to get in run-time the status of the peripheral
    and the data flow.
 @endverbatim
 * @{
 */

/**
 * @brief  Return the PCD state
 * @param  hpcd PCD handle
 * @retval HAL state
 */
PCD_StateTypeDef HAL_PCD_GetState(PCD_HandleTypeDef * hpcd)
{
    return hpcd->State;
}

/**
 * @}
 */
/**
 * @}
 */

/** @addtogroup PCD_Private_Functions
 * @{
 */
/**
 * @brief Copy a buffer from user memory area to packet memory area (PMA)
 * @param   USBx USB peripheral instance register address.
 * @param   pbUsrBuf pointer to user memory area.
 * @param   wPMABufAddr address into PMA.
 * @param   wNBytes no. of bytes to be copied.
 * @retval None
 */
void PCD_WritePMA(USB_TypeDef * USBx,
		  uint8_t * pbUsrBuf,
		  uint16_t wPMABufAddr,
		  uint16_t wNBytes)
{
    uint32_t n = ((uint32_t)((uint32_t)wNBytes + 1U)) >> 1U;
    uint32_t i;
    uint16_t temp1, temp2;
    uint16_t * pdwVal;
    pdwVal = (uint16_t *)((uint32_t)(wPMABufAddr + (uint32_t)USBx + 0x400U));

    for (i = n; i != 0; i--) {
	temp1 = (uint16_t) * pbUsrBuf;
	pbUsrBuf++;
	temp2 = temp1 | ((uint16_t)((uint16_t)  * pbUsrBuf << 8U)) ;
	*pdwVal++ = temp2;
	pbUsrBuf++;
    }
}


/**
 * @brief Copy a buffer from user memory area to packet memory area (PMA)
 * @param   USBx USB peripheral instance register address.
 * @param   pbUsrBuf    = pointer to user memory area.
 * @param   wPMABufAddr address into PMA.
 * @param   wNBytes no. of bytes to be copied.
 * @retval None
 */
void PCD_ReadPMA(USB_TypeDef * USBx,
		 uint8_t * pbUsrBuf,
		 uint16_t wPMABufAddr,
		 uint16_t wNBytes)
{
    uint32_t n = (uint32_t)wNBytes >> 1U;
    uint32_t i;
    uint16_t * pdwVal;
    uint32_t temp;
    pdwVal = (uint16_t *)((uint32_t)(wPMABufAddr + (uint32_t)USBx + 0x400U));

    for (i = n; i != 0U; i--) {
	temp = *pdwVal++;
	*pbUsrBuf++ = ((temp >> 0) & 0xFF);
	*pbUsrBuf++ = ((temp >> 8) & 0xFF);
    }

    if (wNBytes % 2) {
	temp = *pdwVal++;
	*pbUsrBuf++ = ((temp >> 0) & 0xFF);
    }
}


/* ###AO### */
#if 0  // REWRITTEN, BELOW, FOR SPACE/CLARITY
/**
 * @brief  This function handles PCD Endpoint interrupt request.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
static HAL_StatusTypeDef PCD_EP_ISR_Handler(PCD_HandleTypeDef * hpcd)
{
    PCD_EPTypeDef * ep;
    uint16_t count=0U;
    uint8_t EPindex;
    __IO uint16_t wIstr;
    __IO uint16_t wEPVal = 0U;

    /* stay in loop while pending interrupts */
    while (((wIstr = hpcd->Instance->ISTR) & USB_ISTR_CTR) != 0U) {
	/* extract highest priority endpoint number */
	EPindex = (uint8_t)(wIstr & USB_ISTR_EP_ID);

	if (EPindex == 0U) {
	    /* Decode and service control endpoint interrupt */

	    /* DIR bit = origin of the interrupt */
	    if ((wIstr & USB_ISTR_DIR) == 0U) {
		/* DIR = 0 */
		/* DIR = 0 => IN  int */
		/* DIR = 0 implies that (EP_CTR_TX = 1) always  */
		PCD_CLEAR_TX_EP_CTR(hpcd->Instance, PCD_ENDP0);
		ep = &hpcd->IN_ep[0];

