aegean-odyssey/mpmd_marlin_1.1.x/stm32f0xx/stm32f0xx_hal_pcd-ao.c
		ep->xfer_count = PCD_GET_EP_TX_CNT(hpcd->Instance, ep->num);
		ep->xfer_buff += ep->xfer_count;

		/* TX COMPLETE */
		HAL_PCD_DataInStageCallback(hpcd, 0U);


		if((hpcd->USB_Address > 0U)&& ( ep->xfer_len == 0U)) {
		    hpcd->Instance->DADDR = (hpcd->USB_Address | USB_DADDR_EF);
		    hpcd->USB_Address = 0U;
		}
	    }
	    else {
		/* DIR = 1 */
		/* DIR = 1 & CTR_RX => SETUP or OUT int */
		/* DIR = 1 & (CTR_TX | CTR_RX) => 2 int pending */
		ep = &hpcd->OUT_ep[0];
		wEPVal = PCD_GET_ENDPOINT(hpcd->Instance, PCD_ENDP0);

		if ((wEPVal & USB_EP_SETUP) != 0U) {
		    /* Get SETUP Packet */
		    ep->xfer_count = PCD_GET_EP_RX_CNT(hpcd->Instance,ep->num);
		    PCD_ReadPMA(hpcd->Instance,
				(uint8_t*)(void*)hpcd->Setup,
				ep->pmaadress ,
				ep->xfer_count);
		    /* SETUP bit kept frozen while CTR_RX = 1 */
		    PCD_CLEAR_RX_EP_CTR(hpcd->Instance, PCD_ENDP0);
		    /* Process SETUP Packet*/
		    HAL_PCD_SetupStageCallback(hpcd);
		}
		else if ((wEPVal & USB_EP_CTR_RX) != 0U) {
		    PCD_CLEAR_RX_EP_CTR(hpcd->Instance, PCD_ENDP0);
		    /* Get Control Data OUT Packet */
		    ep->xfer_count = PCD_GET_EP_RX_CNT(hpcd->Instance,ep->num);

#if 0  // STM32Cube_FW_F0_V1.10.1
		    if (ep->xfer_count != 0U) {
			    PCD_ReadPMA(hpcd->Instance,
					ep->xfer_buff,
					ep->pmaadress,
					ep->xfer_count);
			    ep->xfer_buff+=ep->xfer_count;
		    }
#else  // STM32Cube_FW_F0_V1.11.0
		    if ((ep->xfer_count != 0U) && (ep->xfer_buff != 0U)) {
			    PCD_ReadPMA(hpcd->Instance,
					ep->xfer_buff,
					ep->pmaadress,
					ep->xfer_count);
			    ep->xfer_buff+=ep->xfer_count;
		    }
#endif
		    /* Process Control Data OUT Packet */
		    HAL_PCD_DataOutStageCallback(hpcd, 0U);

		    PCD_SET_EP_RX_CNT(hpcd->Instance,PCD_ENDP0,ep->maxpacket);
		    PCD_SET_EP_RX_STATUS(hpcd->Instance,
					 PCD_ENDP0,
					 USB_EP_RX_VALID);
		}
	    }
	}
	else {
	    /* Decode and service non control endpoints interrupt */
	    /* process related endpoint register */
	    wEPVal = PCD_GET_ENDPOINT(hpcd->Instance, EPindex);
	    if ((wEPVal & USB_EP_CTR_RX) != 0U) {
		/* clear int flag */
		PCD_CLEAR_RX_EP_CTR(hpcd->Instance, EPindex);
		ep = &hpcd->OUT_ep[EPindex];

		/* OUT double Buffering*/
		if (ep->doublebuffer == 0U) {
		    count = PCD_GET_EP_RX_CNT(hpcd->Instance, ep->num);
		    if (count != 0U) {
			PCD_ReadPMA(hpcd->Instance,
				    ep->xfer_buff,
				    ep->pmaadress,
				    count);
		    }
		}
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
		else {
                    if ((PCD_GET_ENDPOINT(hpcd->Instance, ep->num) &
			 USB_EP_DTOG_RX) == USB_EP_DTOG_RX) {
			/* read from endpoint BUF0Addr buffer */
			count = PCD_GET_EP_DBUF0_CNT(hpcd->Instance, ep->num);
			if (count != 0U) {
			    PCD_ReadPMA(hpcd->Instance,
					ep->xfer_buff,
					ep->pmaaddr0,
					count);
			}
		    }
		    else {
			/* read from endpoint BUF1Addr buffer */
			count = PCD_GET_EP_DBUF1_CNT(hpcd->Instance, ep->num);
			if (count != 0U) {
			    PCD_ReadPMA(hpcd->Instance,
					ep->xfer_buff,
					ep->pmaaddr1,
					count);
			}
		    }
		    PCD_FreeUserBuffer(hpcd->Instance,ep->num,PCD_EP_DBUF_OUT);
		}
#endif // UNNECESSARY CODE FOR OUR APPLICATION
		/* multi-packet on the NON control OUT endpoint */
		ep->xfer_count+=count;
		ep->xfer_buff+=count;

		if ((ep->xfer_len == 0U) || (count < ep->maxpacket)) {
		    /* RX COMPLETE */
		    HAL_PCD_DataOutStageCallback(hpcd, ep->num);
		}
		else {
		    HAL_PCD_EP_Receive(hpcd,
				       ep->num,
				       ep->xfer_buff,
				       ep->xfer_len);
		}

	    } /* if((wEPVal & EP_CTR_RX) */

	    if ((wEPVal & USB_EP_CTR_TX) != 0U) {
		ep = &hpcd->IN_ep[EPindex];
		/* clear int flag */
		PCD_CLEAR_TX_EP_CTR(hpcd->Instance, EPindex);

		/* IN double Buffering*/
		if (ep->doublebuffer == 0U) {
#if 0  // STM32Cube_FW_F0_V1.10.1
		    ep->xfer_count = PCD_GET_EP_TX_CNT(hpcd->Instance,ep->num);
		    if (ep->xfer_count != 0) {
			PCD_WritePMA(hpcd->Instance,
				     ep->xfer_buff,
				     ep->pmaadress,
				     ep->xfer_count);
		    }
#else  // STM32Cube_FW_F0_V1.11.0
#endif
		}
#if 0  // UNNECESSARY CODE FOR OUR APPLICATION
		else {
		    if ((PCD_GET_ENDPOINT(hpcd->Instance, ep->num) &
			 USB_EP_DTOG_TX) == USB_EP_DTOG_TX) {
			/* read from endpoint BUF0Addr buffer */
			ep->xfer_count = PCD_GET_EP_DBUF0_CNT(hpcd->Instance,
							      ep->num);
			if (ep->xfer_count != 0U) {
			    PCD_WritePMA(hpcd->Instance,
					 ep->xfer_buff,
					 ep->pmaaddr0,
					 ep->xfer_count);
			}
		    }
		    else {
			/* read from endpoint BUF1Addr buffer */
			ep->xfer_count = PCD_GET_EP_DBUF1_CNT(hpcd->Instance,
							      ep->num);
			if (ep->xfer_count != 0U) {
			    PCD_WritePMA(hpcd->Instance,
					 ep->xfer_buff,
					 ep->pmaaddr1,
					 ep->xfer_count);
			}
		    }
		    PCD_FreeUserBuffer(hpcd->Instance,ep->num,PCD_EP_DBUF_IN);
		}
#endif // UNNECESSARY CODE FOR OUR APPLICATION
		/*multi-packet on the NON control IN endpoint*/
		ep->xfer_count = PCD_GET_EP_TX_CNT(hpcd->Instance, ep->num);
		ep->xfer_buff += ep->xfer_count;

		/* Zero Length Packet? */
		if (ep->xfer_len == 0U) {
		    /* TX COMPLETE */
		    HAL_PCD_DataInStageCallback(hpcd, ep->num);
		}
		else {
		    HAL_PCD_EP_Transmit(hpcd,
					ep->num,
					ep->xfer_buff,
					ep->xfer_len);
		}
	    }
	}
    }
    return HAL_OK;
}
#endif // REWRITTEN, BELOW


static HAL_StatusTypeDef PCD_EP_ISR_Handler(PCD_HandleTypeDef * hpcd)
{
    PCD_EPTypeDef * ep;
    __IO uint16_t istr;
    __IO uint16_t epval;

#define U8p(x)  ((uint8_t *) x)
#define HI      hpcd->Instance

    /* stay in loop while pending interrupts *!?* */
    while ((istr = HI->ISTR) & USB_ISTR_CTR) {

	uint8_t id = (uint8_t) istr & USB_ISTR_EP_ID;
	epval = PCD_GET_ENDPOINT(HI, id);

	PCD_CLEAR_RX_EP_CTR(HI, id);
	PCD_CLEAR_TX_EP_CTR(HI, id);

	if (epval & USB_EP_CTR_RX) {
	    ep = &hpcd->OUT_ep[id];
	    uint16_t n = PCD_GET_EP_RX_CNT(HI, ep->num);
	    if (id) {
		// non control OUT endpoint
		if (n) {
		    PCD_ReadPMA(HI, ep->xfer_buff, ep->pmaadress, n);
		    ep->xfer_count += n;
		    ep->xfer_buff += n;
		}
		if ((ep->xfer_len == 0) || (n < ep->maxpacket))
		    HAL_PCD_DataOutStageCallback(hpcd, ep->num);
		else
		    HAL_PCD_EP_Receive(hpcd, ep->num,
				       ep->xfer_buff, ep->xfer_len);
	    }
	    else {
		ep->xfer_count = n;
		if (epval & USB_EP_SETUP) {
		    // Ctl SETUP packet
		    PCD_ReadPMA(HI, U8p(hpcd->Setup), ep->pmaadress, n);
		    HAL_PCD_SetupStageCallback(hpcd);
		}
		else {
		    // Ctl Data OUT packet
		    if (ep->xfer_count && ep->xfer_buff) {
			PCD_ReadPMA(HI, ep->xfer_buff, ep->pmaadress, n);
			ep->xfer_buff += n;
		    }
		    HAL_PCD_DataOutStageCallback(hpcd, 0);
		    PCD_SET_EP_RX_CNT(HI, 0, ep->maxpacket);
		    PCD_SET_EP_RX_STATUS(HI, 0, USB_EP_RX_VALID);
		}
	    }
	}

	if (epval & USB_EP_CTR_TX) {
	    ep = &hpcd->IN_ep[id];
	    uint16_t n = PCD_GET_EP_TX_CNT(HI, ep->num);
	    if (id) {
		// non control IN endpoint
		if (n) {
		    PCD_WritePMA(HI, ep->xfer_buff, ep->pmaadress, n);
		    ep->xfer_count = n;
		    ep->xfer_buff += n;
		}
		if (ep->xfer_len == 0)
		    HAL_PCD_DataInStageCallback(hpcd, ep->num);
		else
		    HAL_PCD_EP_Transmit(hpcd, ep->num,
					ep->xfer_buff, ep->xfer_len);
	    }
	    else {
		// Ctrl IN packet?
		ep->xfer_count = n;
		ep->xfer_buff += n;
		HAL_PCD_DataInStageCallback(hpcd, 0); // tx complete
		if ((hpcd->USB_Address > 0) && (ep->xfer_len == 0)) {
		    HI->DADDR = hpcd->USB_Address | USB_DADDR_EF;
		    hpcd->USB_Address = 0;
		}
	    }
	}
    }
    return HAL_OK;
}


/**
 * @}
 */
/**
 * @}
 */
#endif /* STM32F042x6||STM32F072xB||STM32F078xx||STM32F070xB||STM32F070x6 */
#endif /* HAL_PCD_MODULE_ENABLED */
/**
 * @}
 */
/* (C) COPYRIGHT STMicroelectronics */
/***END OF FILE***/
